package com.sakuntswingo.bingo;

public class ChanelQuestions {

    public static String[] question = {
            "В каком году была представлена сумка Chanel 2.55?",
            "Почему сумка Chanel 2.55 получила такое название?",
            "Какой элемент дизайна Chanel 2.55 символизирует детство Шанель?",
            "Какой цвет была изначально внутренняя часть сумки 2.55?",
            "Из какого материала сначала планировалось сделать сумку 2.55?",
            "Как называется застёжка на сумке Chanel 2.55?",
            "Что вдохновило на форму кармана в виде волны в Chanel 2.55?",
            "Какое значение имеет цепочка на сумке Chanel 2.55?",
            "Что вдохновило на форму часов Chanel Première?",
            "В каком отеле жила Коко Шанель?",
            "На какую парижскую площадь похож корпус часов Première?",
            "Какой цвет символизирует детство Коко Шанель?",
            "Когда были выпущены первые часы Chanel?",
            "Кто является создателем аромата Chanel №5?",
            "Какой элемент Chanel №5 связан с Вандомской площадью?"
    };

    public static String[][] choices = {
            {"Февраль 1955", "Март 1956", "Январь 1954", "Апрель 1957"},
            {"Дата рождения Шанель", "Месяц и год выпуска", "Год её смерти", "Сумма инвестиций"},
            {"Цепочка", "Красная подкладка", "Кармашек", "Форма стёжки"},
            {"Красный", "Чёрный", "Серый", "Бежевый"},
            {"Шёлк", "Твид", "Джерси", "Атлас"},
            {"Mademoiselle", "Chanel Lock", "2.55 Original", "Coco Closure"},
            {"Улыбка Моны Лизы", "Овал Вандомской площади", "Форма алмаза", "Форма сердца"},
            {"Детство в приюте", "Элегантность", "Милитаризм", "Ювелирные цепи"},
            {"Форма Вандомской площади", "Коробка для духов", "Письмо Шанель", "Форма сердца"},
            {"Ritz", "Plaza Athénée", "Crillon", "Le Meurice"},
            {"Площадь Вандом", "Площадь Конкорд", "Площадь Бастилии", "Площадь Наций"},
            {"Чёрный", "Золотой", "Красный", "Белый"},
            {"1987", "1990", "1985", "1995"},
            {"Эрнест Бо", "Карл Лагерфельд", "Жак Поль", "Жан Пату"},
            {"Форма флакона", "Цвет жидкости", "Крышка", "Цепочка"}
    };

    public static String[] correctAnswers = {
            "Февраль 1955",
            "Месяц и год выпуска",
            "Цепочка",
            "Красный",
            "Джерси",
            "Mademoiselle",
            "Улыбка Моны Лизы",
            "Детство в приюте",
            "Форма Вандомской площади",
            "Ritz",
            "Площадь Вандом",
            "Чёрный",
            "1987",
            "Эрнест Бо",
            "Форма флакона"
    };
}
