package com.sakuntswingo.bingo;

public class DiorQuestions {
    public static String[] question = {
            "Кто был основателем модного дома Dior?",
            "Какой элемент вдохновил на создание узора канаж?",
            "Сколько моделей участвовало в показах Кристиана Диора из-за его суеверий?",
            "Какое число играло мистическую роль в жизни Диора?",
            "Кто был дизайнером культовой сумки Lady Dior?",
            "Почему буквы D-I-O-R на брелоке сумки имеют значение?",
            "Каким цветком особенно дорожил Кристиан Диор?",
            "С каким символом ассоциируется цифра 8 в символике Диора?",
            "Какое мистическое увлечение особенно выделялось у Диора?",
            "Как называется техника плетения, использованная в узоре канаж?",
            "В честь кого была названа сумка Lady Dior?",
            "Где располагался бутик Dior, в котором стоял вдохновивший узор канаж стул?",
            "Что символизирует деревянная фигурка на брелоке Dior?",
            "Какая фигура в Таро, по слухам, вдохновляла Диора?",
            "Какое животное считается одним из символов удачи Dior?"
    };

    public static String[][] choices = {
            {"Кристиан Диор", "Ив Сен-Лоран", "Жан-Поль Готье", "Карл Лагерфельд"},
            {"Шляпа Диора", "Ваза с лилиями", "Венский стул XVIII века", "Французское окно"},
            {"13", "7", "10", "8"},
            {"8", "3", "13", "5"},
            {"Жан-Франко Ферре", "Габриэль Шанель", "Кристиан Диор", "Раф Симонс"},
            {"Это просто декор", "Они отсылают к имени Dior", "Это амулеты", "Это инициалы модели"},
            {"Роза", "Ландыш", "Орхидея", "Пион"},
            {"Начало", "Вечность", "Судьба", "Тайна"},
            {"Магия", "Гадания", "Астрология", "Все перечисленное"},
            {"Канаж", "Шеврон", "Лозанж", "Кашемир"},
            {"Принцесса Диана", "Мать Диора", "Модель Катрин", "Грейс Келли"},
            {"Версаль", "Париж", "Милан", "Рим"},
            {"Древо жизни", "Удачу (постучать по дереву)", "Бесконечность", "Стойкость"},
            {"Императрица", "Жрица", "Звезда", "Колесо Фортуны"},
            {"Слон", "Птица", "Жаба", "Пчела"}
    };

    public static String[] correctAnswers = {
            "Кристиан Диор",
            "Венский стул XVIII века",
            "13",
            "8",
            "Жан-Франко Ферре",
            "Это амулеты",
            "Ландыш",
            "Вечность",
            "Все перечисленное",
            "Канаж",
            "Принцесса Диана",
            "Париж",
            "Удачу (постучать по дереву)",
            "Звезда",
            "Пчела"
    };
}
