package com.sakuntswingo.bingo;

public class QuestionAnswer {
    public static String question[] = {
            "Какой бренд первым начал массовое производство джинсов?",
            "Какой дизайнер ввёл в моду маленькое чёрное платье?",
            "Какая обувь была названа в честь итальянского слова «трясти» из-за своей гибкой подошвы?",
            "Какая модная марка использует логотип в виде головы медузы?",
            "Какой культовый аксессуар впервые появился в коллекции Hermès в 1935 году и был назван в честь актрисы?",
            "Какая мода называлась “power dressing” и была популярна в 1980-х годах?",
            "Какой дизайнер первым представил концепцию прет-а-порте (готовой одежды)?",
            "Какая спортивная марка первой начала сотрудничество с модными дизайнерами?",
            "Какой знаменитый принт был создан Домом Burberry?",
            "Какой бренд первым выпустил духи, дополняющие модную коллекцию?"
    };

    public static String choices[][] = {
            {"Gucci", "Levi's", "Diesel", "Wrangler"},
            {"Коко Шанель", "Кристиан Диор", "Ив Сен-Лоран", "Джанни Версаче"},
            {"Лоферы", "Слипоны", "Мокасины", "Топсайдеры"},
            {"Balenciaga", "Versace", "Prada", "Dolce & Gabbana"},
            {"Birkin Bag", "Kelly Bag", "Saddle Bag", "Speedy Bag"},
            {"Минимализм", "Деловой стиль с широкими плечами", "Гранж", "Спортивный шик"},
            {"Жан-Поль Готье", "Ив Сен-Лоран", "Пьер Карден", "Кристиан Диор"},
            {"Nike", "Adidas", "Puma", "Reebok"},
            {"Пейсли", "Гусиная лапка", "Виндзорская клетка", "Клетка Nova"},
            {"Chanel", "Dior", "Yves Saint Laurent", "Guerlain"}
    };

    public static String correctAnswers[] = {
            "Levi's",
            "Коко Шанель",
            "Мокасины",
            "Versace",
            "Kelly Bag",
            "Деловой стиль с широкими плечами",
            "Пьер Карден",
            "Adidas",
            "Клетка Nova",
            "Chanel"
    };
}
