package com.sakuntswingo.bingo;

public class ValentinoQuestions {
    public static String question[] = {
            "Чем вдохновлялся Валентино при создании шипов в коллекции «Rockstud»?",
            "Какой цвет стал визитной карточкой Валентино?",
            "Кому Валентино создал свадебное платье в 1968 году?",
            "С каким ювелиром Валентино имел тесную дружбу?",
            "Кто из знаменитостей была верной поклонницей Валентино?",
            "Что символизирует цвет Valentino Red?",
            "Какой дворец вдохновил Валентино на коллекцию с шипами?",
            "Какой стиль наиболее точно описывает эстетику бренда Valentino?",
            "Что, по словам Валентино, выражает красный цвет?",
            "Какой из этих элементов характерен для коллекции Rockstud?",
            "Кто основал модный дом Valentino?",
            "Где был основан бренд Valentino?",
            "Какой актрисе часто шили наряды Valentino?",
            "Какое изделие Valentino стало символом скрытой роскоши?",
            "В каком десятилетии Валентино достиг международной славы?"
    };

    public static String choices[][] = {
            {"Архитектурой Палаццо Диаманти", "Рок-культурой", "Средневековыми доспехами", "Панком 80-х"},
            {"Красный", "Чёрный", "Белый", "Золотой"},
            {"Жаклин Кеннеди", "Грейс Келли", "Одри Хепбёрн", "Принцесса Диана"},
            {"Гарри Уинстоном", "Карл Лагерфельдом", "Пьером Карденом", "Джорджио Армани"},
            {"Элизабет Тейлор", "Мэрилин Монро", "Мадонна", "Леди Гага"},
            {"Страсть и элегантность", "Грусть и утончённость", "Свободу и дикость", "Минимализм"},
            {"Палаццо Диаманти", "Палаццо Веккьо", "Вилла Боргезе", "Колизей"},
            {"Романтический и элегантный", "Готический и агрессивный", "Гранж и спорт-шик", "Минималистичный и урбанистичный"},
            {"Мою страсть к моде", "Скорость современной жизни", "Тайну и интригу", "Ностальгию по детству"},
            {"Пирамидальные шипы", "Цветы", "Кожа", "Бархат"},
            {"Валентино Гаравани", "Джорджо Армани", "Джанни Версаче", "Александр Маккуин"},
            {"Рим", "Милан", "Париж", "Флоренция"},
            {"Элизабет Тейлор", "Кейт Мосс", "Бьорк", "Моника Беллуччи"},
            {"Туфли Rockstud", "Шляпы", "Очки", "Перчатки"},
            {"1960-е", "1980-е", "2000-е", "1970-е"}
    };

    public static String correctAnswers[] = {
            "Архитектурой Палаццо Диаманти",
            "Красный",
            "Жаклин Кеннеди",
            "Гарри Уинстоном",
            "Элизабет Тейлор",
            "Страсть и элегантность",
            "Палаццо Диаманти",
            "Романтический и элегантный",
            "Мою страсть к моде",
            "Пирамидальные шипы",
            "Валентино Гаравани",
            "Рим",
            "Элизабет Тейлор",
            "Туфли Rockstud",
            "1960-е"
    };
}
